{
  "main": {
    "version": "0.89.99",
    "changelog": "DO NOT UPDATE PLUGIN FROM UPDATER\nMain release changelog:\nGeneral Updates:\nVarious UI tweaks and improvements.\nVersion updates for Pedal, Bridge, and Plugin.\nAdded support for V5 board in OTA, WebFlasher and build package.\nImproved KF filter calculation and added a second KF filter for joystick output.\nUpdated DAP version incrementally from 142 to 145.\nAdded error code logging and improved payload handling.\nMajor refactoring of the plugin code by separating UserControl into different files.\n\nPedal\nAdded a warning for failed pedal assignment checks.\nRemoved CDC serial support for the V4 board. V4 users must now connect both USB-C ports for serial and HID access.\nHardware assignment now overrides software assignment.\nAdjusted rudder behavior: it now moves more slowly during initialization and de-initialization.\nAdded a \"boot into download system\" action for V4/V5 boards (not available for Gilphilbert V1.2).\nABS/TC effects now activate only when the pedal is pressed.\nABS frequency adjustment now depends on surface conditions (currently iRacing and ACC only, AC EVO support planned).\nAdded version output in the DAP_basic_state package.\nAdded payload type, DAP version, and CRC check for rudder and joystick output to reduce jitter.\nFixed an issue where error codes were not displayed correctly.\nFixed an OTA page visibility bug when enabled from serial on ESP32 boards.\nReverted the servo special register setting.\n\nBridge\nIncremental version updates alongside Pedal.\nAdded payload type, DAP version, and CRC check for rudder package.\nAdded bridge version output.\n\nPlugin\nAdd community config sharing button.\nAdded preview feature to community config.\nConverted single sliders and labels into UI elements.\nFixed a CRC error bug in the new pedal configuration.\nFixed a version parsing issue for SimHub Beta.\nAdded surface condition detection for ABS frequency adjustment (for iRacing and ACC).\nIntroduced a live preview function: configurations can be sent to the pedal without saving them to storage when making any config variable change. To save, click \"Save to Pedal.\"\nRemoved \"set DTR/RTS false\" option.\nPlugin now displays the pedal and bridge firmware versions.\nAdded servo load calculation; warnings now appear if max force is likely to exceed servo capacity.\n11 Error codes are now logged in the SimHub log.\n12 Added a checkbox and slider for joystick output denoise filtering.\n\nRudder\nDuring initialization, configurations are stored in RAM instead of pedal storage (they will not persist after a restart).\nAdded RPM effect for DCS.\n\nKnown Issues\nThe rudder does not automatically center on initialization; a manual push is required.\n"
  },
  "dev-build": {
    "version": "0.90.07",
    "changelog": "Dev build changelog:\nPedal\n- Accelerated Kalman filter response for faster readings.\n- Implemented force outlier detection and automatic skipping.\n- Loadcell bias and variance are now represented in kilograms.\n- Refactored dap_config_st into a class structure.\n- Servo alarm codes are now decoded into readable strings.\n- Enabled logging over ESP-NOW.\n- Added ability to display RSSI of incoming ESP-NOW packets.\n- Firmware version: 0.90.07\n\nBridge\n- Added support to receive and print pedal log strings sent via ESP-NOW.\n- Resolved issue where no logs were shown when brake configuration was sent.\n- Firmware version: 0.90.07\n\nPlugin\n- Added action to display pedal info; if received via ESP-NOW, also show RSSI.\n- UI enhancements: added separator lines between buttons.\n- Introduced one-click plugin updater via PowerShell.\n- Moved update settings to a dedicated window. You can now enter Wi-Fi credentials, choose the update channel, and review the changelog before proceeding. Available only when using FW OTA or Plugin Update.\n- Plugin version: 0.90.07\n\nRudder\n- Switched force reading filter from velocity-based Kalman filter to exponential filter with a noise factor of 200.\n- Updated movement filter from average filter to Kalman filter."
  },
  "daily-build": {
    "version": "0.90.07",
    "changelog": "SAME AS DEV BUILD\nDaily build changelog:\nPedal\n- Accelerated Kalman filter response for faster readings.\n- Implemented force outlier detection and automatic skipping.\n- Loadcell bias and variance are now represented in kilograms.\n- Refactored dap_config_st into a class structure.\n- Servo alarm codes are now decoded into readable strings.\n- Enabled logging over ESP-NOW.\n- Added ability to display RSSI of incoming ESP-NOW packets.\n- Firmware version: 0.90.07\n\nBridge\n- Added support to receive and print pedal log strings sent via ESP-NOW.\n- Resolved issue where no logs were shown when brake configuration was sent.\n- Firmware version: 0.90.07\n\nPlugin\n- Added action to display pedal info; if received via ESP-NOW, also show RSSI.\n- UI enhancements: added separator lines between buttons.\n- Introduced one-click plugin updater via PowerShell.\n- Moved update settings to a dedicated window. You can now enter Wi-Fi credentials, choose the update channel, and review the changelog before proceeding. Available only when using FW OTA or Plugin Update.\n- Plugin version: 0.90.07\n\nRudder\n- Switched force reading filter from velocity-based Kalman filter to exponential filter with a noise factor of 200.\n- Updated movement filter from average filter to Kalman filter."
  }
}