{
  "main": {
    "version":"0.90.22",
    "changelog": "FOR USER WHO USE PCBA V2 and its verison is 0.90.15 or below,\nplease update this build via USB, DO NOT UPDATE VIA OTA\nChangelog:\nPedal\n\n1. Significant improvement to serial communication.\n2. Refreshed the Pedal control algorithm and integrated new stepper control libraries, removing the legacy PID and MPC tuning options.\n3. Effects amplitude is now represented as a percentage of the force range.\n4. Refactored almost all internal tasks, resulting in a smoother pedal response.\n5. Introduced an auto-save config function which automatically saves the configuration to non-volatile memory 3 minutes after the last change.\n6. Replaced the ESP32 USB stacking libraries with Adafruit TinyUSB to enhance the stability of joystick output.\n7. Switched the Arduino framework version from 2.0.17 to 3.3.0.\n8. Adjusted the partition table for PCBA v2.\n9. Implemented the new assignment system.\n10. Added the ability to send sensor values during the pedal homing sequence.\n11. DAP version: 161\n12. Firmware version: 0.90.22\n\nBridge\n\n1. Refactored tasks to separate serial communication into distinct RX and TX tasks.\n2. Replaced the ESP32 USB stack libraries with Adafruit TinyUSB to improve the stability of joystick output.\n3. Switched the Arduino framework version from 2.0.17 to 3.3.0.\n4. Added support for the new assignment system.\n5. DAP version: 161\n6. Firmware version: 0.90.22\n\nPlugin\n\n1. Removed the deprecated PID and MPC tuning options.\n2. Added Global Effects Threshold Force, Servo Smoothness, and Inertia sliders to the configuration adjustment interface.\n3. Removed the CDC serial option for PCBA v1.2, switching to auto-scan the COM port. If a CDC serial is detected, the related action will be automatically applied.\n4. Further stability improvements to serial communication.\n5. DAP version: 161\n6. Plugin version: 0.90.22"
  },
  "dev-build": {
    "version": "0.90.22",
    "changelog": "\nFOR USER WHO USE PCBA V2 and its verison is 0.90.15 or below, please update this build via USB, DO NOT UPDATE VIA OTA\nsame with stable release.\n"
  },
  "daily-build": {
    "version": "0.90.15",
    "changelog": "\nNightly build changelog:\nSAME AS STABLE RELEASE"
  }
}