{
  "main": {
    "version": "0.89.99",
    "changelog": "DO NOT UPDATE PLUGIN FROM UPDATER\nMain release changelog:General Updates:\nVarious UI tweaks and improvements.\nVersion updates for Pedal, Bridge, and Plugin.\nAdded support for V5 board in OTA, WebFlasher and build package.\nImproved KF filter calculation and added a second KF filter for joystick output.\nUpdated DAP version incrementally from 142 to 145.\nAdded error code logging and improved payload handling.\nMajor refactoring of the plugin code by separating UserControl into different files.\n\nPedal\nAdded a warning for failed pedal assignment checks.\nRemoved CDC serial support for the V4 board. V4 users must now connect both USB-C ports for serial and HID access.\nHardware assignment now overrides software assignment.\nAdjusted rudder behavior: it now moves more slowly during initialization and de-initialization.\nAdded a \"boot into download system\" action for V4/V5 boards (not available for Gilphilbert V1.2).\nABS/TC effects now activate only when the pedal is pressed.\nABS frequency adjustment now depends on surface conditions (currently iRacing and ACC only, AC EVO support planned).\nAdded version output in the DAP_basic_state package.\nAdded payload type, DAP version, and CRC check for rudder and joystick output to reduce jitter.\nFixed an issue where error codes were not displayed correctly.\nFixed an OTA page visibility bug when enabled from serial on ESP32 boards.\nReverted the servo special register setting.\n\nBridge\nIncremental version updates alongside Pedal.\nAdded payload type, DAP version, and CRC check for rudder package.\nAdded bridge version output.\n\nPlugin\nAdd community config sharing button.\nAdded preview feature to community config.\nConverted single sliders and labels into UI elements.\nFixed a CRC error bug in the new pedal configuration.\nFixed a version parsing issue for SimHub Beta.\nAdded surface condition detection for ABS frequency adjustment (for iRacing and ACC).\nIntroduced a live preview function: configurations can be sent to the pedal without saving them to storage when making any config variable change. To save, click \"Save to Pedal.\"\nRemoved \"set DTR/RTS false\" option.\nPlugin now displays the pedal and bridge firmware versions.\nAdded servo load calculation; warnings now appear if max force is likely to exceed servo capacity.\n11 Error codes are now logged in the SimHub log.\n12 Added a checkbox and slider for joystick output denoise filtering.\n\nRudder\nDuring initialization, configurations are stored in RAM instead of pedal storage (they will not persist after a restart).\nAdded RPM effect for DCS.\n\nKnown Issues\nThe rudder does not automatically center on initialization; a manual push is required.\n"
  },
  "dev-build": {
    "version": "0.90.06",
    "changelog": "Dev build changelog:\nPedal\n1. Servo Idle Protection\n- Enabled on all boards except Gilphilbert PCBA v2. This is handled in software by disabling coil engagement.\n- On Gilphilbert, servo idle protection is managed by hardware.\n- For Gilphilbert PCBA v1.2 users:\n  - The LED turns red when idle.\n  - If a buzzer is attached, it will beep.\n  - Set the servo idle timeout value to greater than 0 to enable this feature.\n2. TX Power Adjustment\n- Reduced TX power back to 8.5 dBm for Gilphilbert PCBA v1.2 users.\n3. Version Updates\n- DAP updated to version 149\n- Firmware updated to version 0.90.06\n\nBridge\n1. HID Timeout Fix\n- Fixed an issue where the HID timeout was set to 0.\n2. External Joystick (RP2040 Example)\n- Serial baud rate changed to 921600.\n- You can now use the pedal’s serial log to check debug messages\n  (Enable CDC serial for ESP32S3 on the pedal page connected to RP2040).\n3. Version Updates\n- DAP updated to version 149\n- Firmware updated to version 0.90.06\n\nPlugin\n1. Restart Function Update\n- Removed all DTR/RTS actions for restart. Now uses the action package instead.\n2. Version Updates\n- DAP updated to version 149\n- Plugin updated to version 0.90.06"
  },
  "daily-build": {
    "version": "0.90.07",
    "changelog": "Daily build changelog:\nKF (Kalman Filter) Improvements\nFor users running PID control, we now recommend the following updated values:\nP = 0.01\nI = 1.0\nD = 0.0002\n\nRudder Filter Updates\nRudder movement filter has been updated to use a Kalman filter.\nRudder force reading filter has been switched to an exponential filter.\n\nForce Reading Outlier Detection\nThe system now automatically detects and ignores outliers in force readings to maintain accuracy.\n\nLoadcell Output in Kilograms\nLoadcell shifting and variance are now reported in kg for clearer interpretation.\n\nPlugin updater\nNow you can update the plugin with one click.\n"
  }
}